# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

sum = int(60)

a = int(sum / 6)
b = int(sum / 6 * 4)
c = int(sum / 6)

print(f"Петя сделал {a} журавликов, Катя сделала {b} журавликов, Серёжа сделал {c} журавликов. Всего ребята сделали {sum} журавликов")